artillery-dev.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 20
      name: Warm up phase
 
before:
  flow:
    - log: "Get auth token once before virtual users arrive..."
    - post:
        url: "/auth/signup"
        json:
          username: "myUsername"
          password: "myPassword"
          email: "some@email.com"
    - post:
        url: "/auth/signin"
        json:
          username: "myUsername"
          password: "myPassword"
        capture:
          - json: $.token
            as: token
scenarios:
  - flow:
      - log: "Get complete worklog of the authenticated user..."
      - get:
          url: "/worklog"
          headers:
            authorization: "Bearer {{ token }}"